---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.WaterLoopData.CondenserWaterLoopId
source: html/b9ca47f2-86c4-b68b-ac68-2e1a34954c6b.htm
---
# Autodesk.Revit.DB.Mechanical.WaterLoopData.CondenserWaterLoopId Property

The water loop element id for the water cooled chiller.

## Syntax (C#)
```csharp
public ElementId CondenserWaterLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null